{
  "framework_metadata": {
    "title": "Valor RM Report Chunks",
    "version": "3.0",
    "description": "Chunked relationship management framework for detailed analysis and guidance",
    "total_chunks": 50
  },
  "chunks": [
    {
      "id": 1,
      "title": "Executive Summary",
      "content": "The executive summary provides a comprehensive overview of the engagement objective, classification, key dynamics, and strategic recommendations. It includes the engagement objective (client's primary goal), engagement classification (status, type, threat level), key dynamics (relative power, harm, aid, perceived cost/value, rapport depth, nature of interactions), engagement shift goal (target state and classification), and strategic recommendations with priority moves.",
      "category": "overview",
      "tags": ["executive_summary", "engagement_objective", "strategic_recommendations"]
    },
    {
      "id": 2,
      "title": "Rapport Analysis",
      "content": "Rapport analysis examines the relationship history through frequency, depth, and nature of interactions. Frequency analysis covers how often parties interact over time. Depth analysis uses the Levels of Self model to assess interaction depth (shallow, moderate, deep). Nature analysis characterizes the general impression left after interactions (positive, neutral, negative). The summary explains the overall rapport assessment and its implications for engagement strategy.",
      "category": "analysis",
      "tags": ["rapport", "frequency", "depth", "nature", "relationship_history"]
    },
    {
      "id": 3,
      "title": "Desire Analysis",
      "content": "Desire analysis assesses the target's willingness to engage based on their goals and how they perceive the client's proposition. Goal analysis identifies the target's relevant objectives and their impact. Cost analysis evaluates how the target perceives the resource requirements of the client's proposal. Value analysis assesses how the target perceives the proposal's ability to advance their goals. The summary provides the overall desire assessment and strategic implications.",
      "category": "analysis",
      "tags": ["desire", "goals", "cost", "value", "engagement_willingness"]
    },
    {
      "id": 4,
      "title": "Relative Power Analysis",
      "content": "Relative power analysis examines the balance of influence between parties through respect, harm, and aid components. Respect analysis identifies sources of standing and importance. Harm analysis identifies potential sources of damage to the other party's interests. Aid analysis identifies potential sources of help to the other party's interests. The summary provides the overall power balance assessment and strategic implications.",
      "category": "analysis",
      "tags": ["power", "respect", "harm", "aid", "influence_balance"]
    },
    {
      "id": 5,
      "title": "Vulnerability Analysis",
      "content": "Vulnerability analysis identifies character traits that can be exploited during engagement. Generic vulnerability analysis identifies standard exploitable characteristics. Unique vulnerability analysis identifies specific exploitable traits of the target. The summary provides the overall vulnerability assessment and exploitation strategy recommendations.",
      "category": "analysis",
      "tags": ["vulnerability", "exploitation", "character_traits", "manipulation"]
    },
    {
      "id": 6,
      "title": "Rapport Improvement",
      "content": "Rapport improvement strategies focus on enhancing the relationship quality through frequency, depth, and nature improvements. Frequency improvement identifies steps to increase interaction frequency. Depth improvement identifies steps to increase interaction depth. Nature improvement identifies messaging to promote positive interactions and avoid negative ones. The summary provides the overall rapport enhancement strategy.",
      "category": "improvement",
      "tags": ["rapport_improvement", "frequency", "depth", "nature", "relationship_enhancement"]
    },
    {
      "id": 7,
      "title": "Desire Improvement",
      "content": "Desire improvement strategies focus on enhancing the target's willingness to engage through cost and value improvements. Cost improvement identifies steps to reduce the target's perceived cost of the proposal. Value improvement identifies steps to increase the target's perceived value of the proposal. The summary provides the overall desire enhancement strategy.",
      "category": "improvement",
      "tags": ["desire_improvement", "cost", "value", "engagement_willingness"]
    },
    {
      "id": 8,
      "title": "Relative Power Improvement",
      "content": "Relative power improvement strategies focus on enhancing the client's influence through respect, harm, and aid improvements. Respect improvement identifies steps to increase the client's standing with the target. Harm improvement identifies steps to increase the client's ability to harm the target's interests. Aid improvement identifies steps to increase the client's ability to help the target's interests. The summary provides the overall power enhancement strategy.",
      "category": "improvement",
      "tags": ["power_improvement", "respect", "harm", "aid", "influence_enhancement"]
    },
    {
      "id": 9,
      "title": "Exploitation Preparation",
      "content": "Exploitation preparation involves developing strategies to use identified vulnerabilities during engagement. Generic preparation develops strategies for standard vulnerabilities. Unique preparation develops strategies for specific target vulnerabilities. The summary provides the overall exploitation strategy and tactical guidance.",
      "category": "preparation",
      "tags": ["exploitation", "vulnerability", "manipulation", "tactical_preparation"]
    },
    {
      "id": 10,
      "title": "Engagement Strategy - Opening",
      "content": "The opening phase sets the tone for the engagement through greeting and orientation. Greeting establishes the appropriate level of formality and small-talk subjects based on rapport level. Orientation presents the proposal as a solution to the target's goals without making the actual pitch, including recent improvements the target may not be aware of.",
      "category": "strategy",
      "tags": ["opening", "greeting", "orientation", "engagement_phase"]
    },
    {
      "id": 11,
      "title": "Engagement Strategy - Middle Game",
      "content": "The middle game phase involves the core engagement through pitch softener, pitch delivery, resistance handling, and tactical employment. Pitch softener anticipates and defuses potential resistance points. Pitch delivery provides the verbatim script for presenting the proposal. Receive resistance involves listening completely to all resistance points. Count-resistance tactics employ persuasion, manipulation, or exploitation as needed. Post-tactic checkup gauges desire level after tactics.",
      "category": "strategy",
      "tags": ["middle_game", "pitch", "resistance", "tactics", "engagement_phase"]
    },
    {
      "id": 12,
      "title": "Engagement Strategy - Closing",
      "content": "The closing phase finalizes the engagement through close and post-close soothing. Close involves obtaining concurrence on the request and delivering any needed information. Post-close soothing provides appropriate thanks and encouragement to make the target feel good about their decision.",
      "category": "strategy",
      "tags": ["closing", "close", "soothing", "engagement_phase"]
    },
    {
      "id": 13,
      "title": "Scoring Systems - Rapport",
      "content": "Rapport scoring uses three components: frequency (rare=-1, occasional=0, often=1), depth (shallow=-1, moderate=0, deep=1), and nature (negative=-1, neutral=0, positive=1). These scores are combined to assess overall rapport quality and determine relationship classification.",
      "category": "scoring",
      "tags": ["rapport_scoring", "frequency", "depth", "nature", "scoring_system"]
    },
    {
      "id": 14,
      "title": "Scoring Systems - Desire",
      "content": "Desire scoring uses value and cost components. Value scores: fulfills goal=3, reasonably furthers goal=2, little goal progress=1, no goal progress=0, pushes goal away=-1. Cost scores: requires more resources than owned=3, requires large amount resources=2, requires few resources=1, requires no resources=0, gives back resources=-1. Desire equals value minus cost.",
      "category": "scoring",
      "tags": ["desire_scoring", "value", "cost", "scoring_system"]
    },
    {
      "id": 15,
      "title": "Scoring Systems - Relative Power",
      "content": "Relative power scoring uses respect, harm, and aid components. Respect: you important to them=1, you not important to them=0, they important to you=-1, they not important to you=0. Harm: you can harm them=1, you cannot harm them=0, they can harm you=-1, they cannot harm you=0. Aid: you can aid them=1, you cannot aid them=0, they can aid you=-1, they cannot aid you=0.",
      "category": "scoring",
      "tags": ["power_scoring", "respect", "harm", "aid", "scoring_system"]
    },
    {
      "id": 16,
      "title": "Relationship Classification",
      "content": "Relationship classification uses a scoring system from 10 (Golden Ally) to -10 (Total Adversary). Golden Ally (10): Near-perfect alignment, full trust, mutual interest, and influence — act boldly. Prime Partner (9): Strong rapport, shared goals, and advantageous leverage — move assertively. Strategic Friend (8): Trust and interest align well; engagement is likely to yield strong returns. Reliable Backer (7): Mostly aligned and cooperative — useful for support or joint efforts.",
      "category": "classification",
      "tags": ["relationship_classification", "scoring", "relationship_types", "strategic_guidance"]
    },
    {
      "id": 17,
      "title": "Relationship Types - Positive",
      "content": "Positive relationship types include Favorable Contact (6): Generally warm and interested — good timing for collaborative outreach. Open Opportunity (5): Neutral-to-positive stance — positive engagement likely with right approach. Willing Associate (4): Some alignment and soft rapport — viable with modest effort. Cautious Ally (3): Engagement is possible but requires rapport-building or value show.",
      "category": "classification",
      "tags": ["positive_relationships", "relationship_types", "engagement_strategy"]
    },
    {
      "id": 18,
      "title": "Relationship Types - Neutral",
      "content": "Neutral relationship types include Mixed Potential (2): Uneven footing — carefully assess intent and influence before advancing. Uncertain Ground (1): Weak alignment, but no hostility — possible to influence with caution. Neutral Zone (0): Neither for nor against — engagement impact will depend on context. Disinterested (-1): Low engagement energy — indifferent or unmotivated relationship.",
      "category": "classification",
      "tags": ["neutral_relationships", "relationship_types", "engagement_strategy"]
    },
    {
      "id": 19,
      "title": "Relationship Types - Negative",
      "content": "Negative relationship types include Cool Distance (-2): Little warmth or alignment — minimal engagement return expected. Soft Resistance (-3): Subtle friction or low buy-in — may slow or block progress passively. Guarded Adversary (-4): Resistant and skeptical — likely to resist influence or oppose softly. Opposed Actor (-5): Active disinterest or mild hostility — engagement is risky.",
      "category": "classification",
      "tags": ["negative_relationships", "relationship_types", "engagement_strategy"]
    },
    {
      "id": 20,
      "title": "Relationship Types - Hostile",
      "content": "Hostile relationship types include Tactical Threat (-6): Opposes your intent with some leverage — may need containment. Strategic Obstacle (-7): Likely to undermine or block your efforts — manage or isolate. Influential Enemy (-8): Active, resourced opposition — avoid engagement or disarm diplomatically. Hostile Force (-9): High risk, high resistance — engagement invites harm or sabotage. Total Adversary (-10): Complete misalignment — hostile, powerful, and oppositional. Avoid.",
      "category": "classification",
      "tags": ["hostile_relationships", "relationship_types", "engagement_strategy"]
    },
    {
      "id": 21,
      "title": "Tactical Frameworks - Persuasion",
      "content": "Persuasion frameworks include offensive persuasion: goal (convince them your request will further their goals), cost (convince them your request will not cost them as much as they believe), confused (convince them they should desire your request). Defensive persuasion: goal (convince them their request will be detrimental to their goals), cost (convince them their request will cost them much more than they thought), confused (convince them they should not desire their request).",
      "category": "tactics",
      "tags": ["persuasion", "offensive", "defensive", "tactical_frameworks"]
    },
    {
      "id": 22,
      "title": "Tactical Frameworks - Manipulation",
      "content": "Manipulation frameworks include offensive manipulation: high respect (show how they would lose standing with you for refusing), high harm (show how you could damage their goals if they refuse), high aid (show how you could benefit their goals if they accept). Defensive manipulation: high respect (show how they would lose standing with you for pursuing), high harm (show how you could damage their goals if they pursue), high aid (show how you could benefit their goals if they drop).",
      "category": "tactics",
      "tags": ["manipulation", "offensive", "defensive", "tactical_frameworks"]
    },
    {
      "id": 23,
      "title": "Engagement Types",
      "content": "Engagement types include offensive (you want something, they don't): lead with value, build rapport, use persuasion over manipulation. Defensive (they want something, you don't): resist firmly, maintain boundaries, avoid unnecessary concessions. Competitive (both parties want something from each other): negotiate for mutual benefit, find creative solutions.",
      "category": "strategy",
      "tags": ["engagement_types", "offensive", "defensive", "competitive", "strategic_approach"]
    },
    {
      "id": 24,
      "title": "Tactical Guidance",
      "content": "Tactical guidance includes persuasion: offensive (convince them your request benefits their goals), defensive (convince them their request harms their goals). Manipulation: offensive (use power to make your request more desirable), defensive (use power to make their request less desirable). Exploitation: intellectual (use their lack of knowledge or understanding), emotional (use their emotional vulnerabilities).",
      "category": "tactics",
      "tags": ["tactical_guidance", "persuasion", "manipulation", "exploitation"]
    },
    {
      "id": 25,
      "title": "Report Structure Overview",
      "content": "The Valor RM Report structure includes executive summary (engagement objective, classification, key dynamics, strategic recommendations), analysis sections (rapport, desire, relative power, vulnerability), improvement sections (rapport, desire, relative power), exploitation preparation, and engagement strategy (opening, middle game, closing). Each section provides detailed analysis and strategic guidance for relationship management.",
      "category": "overview",
      "tags": ["report_structure", "analysis_sections", "improvement_sections", "engagement_strategy"]
    }
  ]
} 